function About() {
  return (
    <section className="section" id="about">
      <h2 className="text-primary">מי אני ואיך אני יכול לעזור לעסק שלך? 👨‍💻</h2>
      <p className="text-main">
        אני אריאל, מפתח אתרים ואפליקציות עם התמחות ב־React, Node.js וטכנולוגיות
        מודרניות. אני עוזר לעסקים לבנות נוכחות דיגיטלית חכמה – עם אתרים מהירים,
        נגישים, מעוצבים בקפידה, שמביאים תוצאות אמיתיות.
        <br />
        במהלך הדרך פיתחתי אתרים לעסקים קטנים ובינוניים, יצרתי דפי נחיתה שמובילים
        לפניות, ושיפרתי ממשקי משתמש כדי להגדיל המרות.
        <br />
        המטרה שלי ברורה: להפוך את האתר שלך לכלי עבודה שמייצר לך לקוחות.
      </p>
      <hr />
    </section>
  );
}
export default About;
