import Offer from "../components/Offer";

function MyOffers() {
  return (
    <div id="my-offer">
      <Offer
        title={"💼 אתרים שמייצרים נוכחות ובונים אמון"}
        description={
          "הנוכחות שלך באינטרנט היא כרטיס הביקור הדיגיטלי שלך. אתר מקצועי לעסק שלך יוצר רושם ראשוני חזק, בונה אמון מול הלקוחות, ומבהיר שאתה כאן כדי להישאר. אני בונה אתרים שמייצגים אותך כמו שצריך – ברמה הגבוהה ביותר."
        }
      />
      <Offer
        title={`🛠️ בנייה ועיצוב אתרים בהתאמה אישית
`}
        description={` בין אם אתה עצמאי, חנות או עסק גדול – אני בונה אתרים מדויקים לצרכים שלך. עם דגש על חוויית משתמש (UX), עיצוב מודרני וקריאה לפעולה ברורה, כל אתר שאני יוצר מותאם אישית עבורך – כדי להמיר גולשים ללקוחות.

`}
      />
      <Offer
        title={`📱 התאמה לנייד ומחשבים – כי הלקוח תמיד גולש
`}
        description={
          "רוב הגולשים מגיעים מהסמארטפון – לכן כל אתר שאני בונה מותאם 100% לכל מסך, כולל ניידים, טאבלטים ודסקטופ. בלי לגלול הצידה, בלי בלגן – רק חוויית גלישה חלקה ונעימה."
        }
      />

      <Offer
        title={`⚙️ ביצועים, מהירות וקידום אורגני
`}
        description={`האתרים שלי בנויים בטכנולוגיות המתקדמות ביותר, עם טעינה מהירה והתאמה מלאה לקידום במנועי חיפוש (SEO). כך שהאתר שלך לא רק ייראה מעולה – הוא גם יימצא בגוגל.`}
      />
      <Offer
        title={`✨ שירות כולל – מא’ עד ת’
`}
        description={`אני מלווה אותך לאורך כל הדרך: אפיון, עיצוב, פיתוח, העלאת האתר לאוויר, וחיבור לדומיין. אתה לא צריך להבין בטכנולוגיה – אני דואג להכל, ונותן לך אתר מוכן לעבודה.`}
      />
    </div>
  );
}

export default MyOffers;
