import Card from "../components/Card";

function Portfolio() {
  return (
    <section id="portfolio" className="section">
      <h2 className="text-primary mb-4">עבודות נבחרות</h2>
      <div className="d-flex gap-5 flex-wrap justify-content-center">
        <Card
          title={"מערכת ניהול כרטיסים אינטראקטיבית"}
          description={`פיתחתי מערכת ניהול כרטיסים אינטראקטיבית שמבוססת על חיבור ישיר למערכת שרת חיצונית שמספקת את המידע דרך ממשק תקשורת (API). כך, המערכת מתעדכנת בזמן אמת עם כל הנתונים, ואתה יכול לנהל את המוצרים או השירותים שלך בקלות — להוסיף, לערוך ולמחוק מידע בלי צורך במומחה טכני. הלקוחות יכולים לצפות, לאהוב ולשמור כרטיסים מועדפים, מה שמחזק את הקשר איתם. המערכת פשוטה להפעלה, רספונסיבית ומתאימה לכל מכשיר, וחוסכת לך זמן וכסף בניהול ובתחזוקה. זו הפתרון האידיאלי לשמור על סדר וארגון בעסק ולהעניק ללקוחות חוויית שימוש איכותית ומודרנית.`}
          image={"frontEndImg.png"}
          goToSite={"https://cards-app.onrender.com/"}
          siteName={"אל האתר"}
          goToCode={"אל הקוד"}
          haveSite
          haveRepo
          repoLink={"https://github.com/furchan1997/cards-app"}
        />

        <Card
          title={"אפליקציית אסטרולוגיה"}
          description={`הלקוחה שלי רצתה אתר אסטרולוגיה שמכיל מאמרים, הורוסקופים ותכנים מותאמים – חלק מהם פתוחים, וחלק בלעדיים לחברים רשומים.
היום היא יכולה לערוך כל תוכן בלחיצת כפתור, לעקוב אחרי המשתמשים שלה, ולנהל את כל המערכת בעצמה.
המשתמשים שלה יכולים לשמור תכנים שמעניינים אותם, לראות תוכן שמותאם להם אישית, וליהנות מחוויית שימוש נעימה ונגישה.
האתר עדיין לא באוויר לבקשת הלקוחה, שרוצה להוסיף תכנים ופיצ'רים נוספים לפני ההשקה הרשמית – לכן הקישור אינו פומבי בשלב זה. (קיים אפשרות לראות את הקוד במידה ותרצו, נמצא בקישור פה למטה)`}
          image={"fullStackImg.png"}
          goToCode={"אל הקוד"}
          haveRepo
          repoLink={"https://github.com/furchan1997/FULLSTACK_PROJECT"}
        />

        <Card
          title={"משחק 4 בשורה"}
          description={`פיתחתי משחק אינטראקטיבי שמדגים איך אני יודע לקחת רעיון ולממש אותו בצורה חיה, עם לוגיקה מורכבת שמאפשרת למשתמשים לשחק, לקבל משוב מיידי ולהנות מחוויה ויזואלית נעימה.
זה מראה שאני לא רק כותב קוד, אלא גם חושב על חוויית המשתמש ומיישם פתרונות יצירתיים — דבר שחשוב מאוד כשבונים אתרים או אפליקציות לעסק שלך.`}
          image={"gameImg.png"}
          siteName={"אל המשחק"}
          goToSite={"/game/fourInARow.html"} // שים לב לשם הנכון של הקובץ
          goToCode={"אל הקוד"}
          haveSite
        />
        <Card
          title={`דך נחיתה לעסק`}
          description={`דף הנחיתה הוא הפנים של העסק שלך ברשת.
אני מפתח דפי נחיתה שמושכים את תשומת הלב, מבהירים את המסר שלך בצורה מדויקת, ומובילים את המבקר לפעולה – בין אם זה למלא טופס, להתקשר, או לרכוש.
העבודה שלי מבטיחה שהדף יעבוד היטב בכל מכשיר, ייטען מהר, וייתן ללקוחות שלך חוויה נעימה ויעילה.`}
          image={"LandingPage.png"}
          siteName={"דף הנחיתה המלא"}
          goToSite={"landingPage/index.html"}
          goToCode={"אל הקוד"}
          haveSite
        />
      </div>
      <hr />
    </section>
  );
}

export default Portfolio;
